# Найти сумму всех n-значных чисел (1 < = n < =4). 
while True:
    x = input('Введите число от 1 до 4.')
    if x == 1:
        pass
    elif x == 2:
        pass
    elif x == 3:
        pass
    elif x == 4:
        pass
    else:
        print('Что?')
    print(x)
